# Groupby
- Pandas의Groupby = SQL의Group by

In [37]:
import pandas as pd
import numpy as np

In [38]:
data = pd.DataFrame(
    {"부서" : ["영업1팀","영업1팀","영업2팀","해외영업팀","해외영업팀","영업1팀", \
             "해외영업팀","영업1팀","해외영업팀","영업2팀","영업2팀","해외영업팀"],
     "순위" : [1, 2, 1, 3, 2, 1,\
             1, 2, 3, 1, 2, 1],
     "연도" : [2014, 2015, 2014, 2017, 2017, 2019, \
             2019, 2020, 2020, 2014, 2015, 2015],
     "매출액": [876,788,900,789,657,910,\
             987,760,670,788,980,877]
    })
data

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
2    영업2팀   1  2014  900
3   해외영업팀   3  2017  789
4   해외영업팀   2  2017  657
5    영업1팀   1  2019  910
6   해외영업팀   1  2019  987
7    영업1팀   2  2020  760
8   해외영업팀   3  2020  670
9    영업2팀   1  2014  788
10   영업2팀   2  2015  980
11  해외영업팀   1  2015  877

In [39]:
data.groupby("부서")["매출액"].sum() #결과는 시리즈 형으로 출력됩니다. #부서별 매출액을 보겠따 
#["매출액"] : 그룹바이 할때 무엇을 기준으로 할 것인가?
# ()대분류 역할
# [] 중분류 역할.

부서
영업1팀     3334
영업2팀     2668
해외영업팀    3980
Name: 매출액, dtype: int64

In [40]:
data.groupby("연도")["매출액"].sum() #결과는 시리즈 형으로 출력됩니다. #연도별 매출액을 보겠다

연도
2014    2564
2015    2645
2017    1446
2019    1897
2020    1430
Name: 매출액, dtype: int64

In [44]:
multi = data.groupby(["부서","연도"])["매출액"].sum() #각 부서별 년도의 매출액
multi

부서     연도
영업1팀   2014     876
       2015     788
       2019     910
       2020     760
영업2팀   2014    1688
       2015     980
해외영업팀  2015     877
       2017    1446
       2019     987
       2020     670
Name: 매출액, dtype: int64

In [45]:
multi.index #리스트형, 또는 시리즈형태이다.

MultiIndex([( '영업1팀', 2014),
            ( '영업1팀', 2015),
            ( '영업1팀', 2019),
            ( '영업1팀', 2020),
            ( '영업2팀', 2014),
            ( '영업2팀', 2015),
            ('해외영업팀', 2015),
            ('해외영업팀', 2017),
            ('해외영업팀', 2019),
            ('해외영업팀', 2020)],
           names=['부서', '연도'])

In [46]:
multi.unstack()
# unstack() : 데이터 프레임형으로 바꾼다.
#unstack()을 사용하면 NaN, 즉, 누락된 값을 확인하기 좋다.

연도       2014   2015    2017   2019   2020
부서
영업1팀    876.0  788.0     NaN  910.0  760.0
영업2팀   1688.0  980.0     NaN    NaN    NaN
해외영업팀     NaN  877.0  1446.0  987.0  670.0

In [47]:
multi["영업1팀" : "영업2팀"]

부서    연도
영업1팀  2014     876
      2015     788
      2019     910
      2020     760
영업2팀  2014    1688
      2015     980
Name: 매출액, dtype: int64

In [48]:
multi.unstack().fillna(0) #

연도       2014   2015    2017   2019   2020
부서
영업1팀    876.0  788.0     0.0  910.0  760.0
영업2팀   1688.0  980.0     0.0    0.0    0.0
해외영업팀     0.0  877.0  1446.0  987.0  670.0

# Aggrigation(집계)
- agg()라고 쓰면된다.

In [51]:
myGroup = data.groupby("부서") #myGroup은 아직 출력할 데이터는 없음...

In [52]:
for name, group in myGroup :
    print(name)

영업1팀
영업2팀
해외영업팀

In [54]:
for name, group in myGroup :
    print(group) #각팀 , 즉 영업1팀, 영업2팀, 해외영업팀별로 순위/연도/매출액을 출력

     부서  순위    연도  매출액
0  영업1팀   1  2014  876
1  영업1팀   2  2015  788
5  영업1팀   1  2019  910
7  영업1팀   2  2020  760
      부서  순위    연도  매출액
2   영업2팀   1  2014  900
9   영업2팀   1  2014  788
10  영업2팀   2  2015  980
       부서  순위    연도  매출액
3   해외영업팀   3  2017  789
4   해외영업팀   2  2017  657
6   해외영업팀   1  2019  987
8   해외영업팀   3  2020  670
11  해외영업팀   1  2015  877

In [57]:
group.agg(np.mean) #순위에대한 평균, 연도에대한 평균, 매출액에 대한 평균이 나온ㄷ.

순위        2.0
연도     2017.6
매출액     796.0
dtype: float64

In [58]:
myGroup.agg(np.mean)#순위에대한 평균, 연도에대한 평균, 매출액에 대한 평균이 나온ㄷ.

             순위           연도         매출액
부서
영업1팀   1.500000  2017.000000  833.500000
영업2팀   1.333333  2014.333333  889.333333
해외영업팀  2.000000  2017.600000  796.000000

In [60]:
#각 팀 별 매출액에 대한 합계,평균,최대,최소까지 셋트로 나오게한다.
#필요없는 순위에대한 평균, 연도에대한 평균은 안나오게.
myGroup["매출액"].agg([np.sum,np.mean,np.max,np.min])

        sum        mean  amax  amin
부서
영업1팀   3334  833.500000   910   760
영업2팀   2668  889.333333   980   788
해외영업팀  3980  796.000000   987   657

## filter()

In [69]:
data.groupby("부서").filter(lambda x : len(x) > 3)#행의 개수가 3개 이상인 경우만 출력
#filter()에게는 참/거짓을 출력할 수 있는 조건들을 넣는게 좋다.
# 람다 함수를 활용하여 filter의 조건문을 정의하는 경우가 많다.

       부서  순위    연도  매출액
0    영업1팀   1  2014  876
1    영업1팀   2  2015  788
3   해외영업팀   3  2017  789
4   해외영업팀   2  2017  657
5    영업1팀   1  2019  910
6   해외영업팀   1  2019  987
7    영업1팀   2  2020  760
8   해외영업팀   3  2020  670
11  해외영업팀   1  2015  877

In [73]:
data.groupby("부서").filter(lambda x : x["매출액"].mean() > 880)#부서별 매출액이 800이ㅅ

      부서  순위    연도  매출액
2   영업2팀   1  2014  900
9   영업2팀   1  2014  788
10  영업2팀   2  2015  980